## Insert Data Into Table

* We need to use **INSERT** clause to insert the data.

```sql
INSERT INTO 
    table_name (col1, col2, col3)
VALUES 
    (val1, val2, val3)
```

* If we don't pass columns after table name then we need to specify values for all the columns. It is not good practice to insert records without specifying column names.

* If we do not specify value for `SERIAL` field, a sequence generated number will be used.

* It is not mandatory to pass the values for those fields where `DEFAULT` is specified. Values specified in `DEFAULT` clause will be used.

* It is mandatory to specify columns and corresponding values for all columns where `NOT NULL` is specified.

In [1]:
%load_ext sql

In [2]:
%env DATABASE_URL=postgresql://suryakantkumar:None@localhost:5432/suryakantkumar

env: DATABASE_URL=postgresql://suryakantkumar:None@localhost:5432/suryakantkumar

* We can use **TRUNCATE** to cleanup any data that will be available in the specified table.

In [3]:
%%sql

TRUNCATE TABLE
    users;

Done.

[]

* Insert single row into the **users** table

In [4]:
%%sql

INSERT INTO
    users (user_first_name, user_last_name, user_email_id)
VALUES
    ('Scott', 'Tiger', 'scott@tiger.com')

 * postgresql://suryakantkumar:***@localhost:5432/suryakantkumar
1 rows affected.

[]

* Insert Multiple rows of data at a time

In [5]:
%%sql

INSERT INTO 
    users (user_first_name, user_last_name, user_email_id, user_password, user_role, is_active) 
VALUES 
    ('Gordan', 'Bradock', 'gbradock0@barnesandnoble.com', 'h9LAz7p7ub', 'U', true),
    ('Tobe', 'Lyness', 'tlyness1@paginegialle.it', 'oEofndp', 'U', true),
    ('Addie', 'Mesias', 'amesias2@twitpic.com', 'ih7Y69u56', 'U', true)

 * postgresql://suryakantkumar:***@localhost:5432/suryakantkumar
3 rows affected.

[]

* To commit the changes, we can use **COMMIT** clause.

In [6]:
%%sql

COMMIT;

 * postgresql://suryakantkumar:***@localhost:5432/suryakantkumar
Done.

[]

In [7]:
%%sql 

SELECT 
    *
FROM
    users

 * postgresql://suryakantkumar:***@localhost:5432/suryakantkumar
4 rows affected.

[(1, 'Scott', 'Tiger', 'scott@tiger.com', False, None, 'U', False, datetime.datetime(2022, 11, 28, 2, 11, 7, 376447), datetime.datetime(2022, 11, 28, 2, 11, 7, 376447)),
 (2, 'Gordan', 'Bradock', 'gbradock0@barnesandnoble.com', False, 'h9LAz7p7ub', 'U', True, datetime.datetime(2022, 11, 28, 2, 11, 39, 694736), datetime.datetime(2022, 11, 28, 2, 11, 39, 694736)),
 (3, 'Tobe', 'Lyness', 'tlyness1@paginegialle.it', False, 'oEofndp', 'U', True, datetime.datetime(2022, 11, 28, 2, 11, 39, 694736), datetime.datetime(2022, 11, 28, 2, 11, 39, 694736)),
 (4, 'Addie', 'Mesias', 'amesias2@twitpic.com', False, 'ih7Y69u56', 'U', True, datetime.datetime(2022, 11, 28, 2, 11, 39, 694736), datetime.datetime(2022, 11, 28, 2, 11, 39, 694736))]